Revit 2026 API
TemperatureRatingTypeSet.Erase Method
Removes a specified TemperatureRating type from the set.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public virtual int Erase(
	TemperatureRatingType item
)
Public Overridable Function Erase (
	item As TemperatureRatingType
) As Integer
public:
virtual int Erase(
	TemperatureRatingType^ item
)
abstract Erase :
        item : TemperatureRatingType -> int
override Erase :
        item : TemperatureRatingType -> int
Parameters
item TemperatureRatingType
The TemperatureRating type to be erased.
Return Value
Int32
The number of TemperatureRating types that were erased from the set.
See Also
Reference
TemperatureRatingTypeSet Class
Autodesk.Revit.DB.Electrical Namespace